lab8/requests/installments/createInstallment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="pl/pwr/java/lab8/soap/installments">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:createInstallmentRequest>
            <installment>
                <id>-1</id>
                <eventId>3</eventId>
                <installmentNumber>-1</installmentNumber>
                <dueDate>2021-04-29+02:00</dueDate>
                <amount>100</amount>
            </installment>
        </gs:createInstallmentRequest>
    </soapenv:Body>
</soapenv:Envelope>